scripts/embeddings/report/runs/staging-20260519T140231Z/enrichment-baseline/enrichment.log
== k6 scenario=hub-enrichment profile=baseline ==

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: scripts/embeddings/k6/hub-enrichment.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * baseline: 1.00 iterations/s for 5m0s (maxVUs: 2-10, gracefulStop: 30s)


running (0m01.0s), 01/02 VUs, 1 complete and 0 interrupted iterations
baseline   [   0% ] 01/02 VUs  0m01.0s/5m0s  1.00 iters/s

running (0m02.0s), 01/02 VUs, 2 complete and 0 interrupted iterations
baseline   [   1% ] 01/02 VUs  0m02.0s/5m0s  1.00 iters/s

running (0m03.0s), 01/02 VUs, 3 complete and 0 interrupted iterations
baseline   [   1% ] 01/02 VUs  0m03.0s/5m0s  1.00 iters/s

running (0m04.0s), 01/02 VUs, 4 complete and 0 interrupted iterations
baseline   [   1% ] 01/02 VUs  0m04.0s/5m0s  1.00 iters/s

running (0m05.0s), 00/02 VUs, 5 complete and 0 interrupted iterations
baseline   [   2% ] 00/02 VUs  0m05.0s/5m0s  1.00 iters/s

running (0m06.0s), 01/02 VUs, 6 complete and 0 interrupted iterations
baseline   [   2% ] 01/02 VUs  0m06.0s/5m0s  1.00 iters/s

running (0m07.0s), 00/02 VUs, 7 complete and 0 interrupted iterations
baseline   [   2% ] 00/02 VUs  0m07.0s/5m0s  1.00 iters/s

running (0m08.0s), 00/02 VUs, 8 complete and 0 interrupted iterations
baseline   [   3% ] 01/02 VUs  0m08.0s/5m0s  1.00 iters/s

running (0m09.0s), 01/02 VUs, 9 complete and 0 interrupted iterations
baseline   [   3% ] 01/02 VUs  0m09.0s/5m0s  1.00 iters/s

running (0m10.0s), 00/02 VUs, 10 complete and 0 interrupted iterations
baseline   [   3% ] 01/02 VUs  0m10.0s/5m0s  1.00 iters/s

running (0m11.0s), 00/02 VUs, 11 complete and 0 interrupted iterations
baseline   [   4% ] 00/02 VUs  0m11.0s/5m0s  1.00 iters/s

running (0m12.0s), 01/02 VUs, 12 complete and 0 interrupted iterations
baseline   [   4% ] 01/02 VUs  0m12.0s/5m0s  1.00 iters/s

running (0m13.0s), 00/02 VUs, 13 complete and 0 interrupted iterations
baseline   [   4% ] 00/02 VUs  0m13.0s/5m0s  1.00 iters/s

running (0m14.0s), 01/02 VUs, 14 complete and 0 interrupted iterations
baseline   [   5% ] 01/02 VUs  0m14.0s/5m0s  1.00 iters/s

running (0m15.0s), 01/02 VUs, 15 complete and 0 interrupted iterations
baseline   [   5% ] 01/02 VUs  0m15.0s/5m0s  1.00 iters/s

running (0m16.0s), 01/02 VUs, 16 complete and 0 interrupted iterations
baseline   [   5% ] 01/02 VUs  0m16.0s/5m0s  1.00 iters/s

running (0m17.0s), 01/02 VUs, 17 complete and 0 interrupted iterations
baseline   [   6% ] 01/02 VUs  0m17.0s/5m0s  1.00 iters/s

running (0m18.0s), 00/02 VUs, 18 complete and 0 interrupted iterations
baseline   [   6% ] 00/02 VUs  0m18.0s/5m0s  1.00 iters/s

running (0m19.0s), 00/02 VUs, 19 complete and 0 interrupted iterations
baseline   [   6% ] 00/02 VUs  0m19.0s/5m0s  1.00 iters/s

running (0m20.0s), 01/02 VUs, 20 complete and 0 interrupted iterations
baseline   [   7% ] 01/02 VUs  0m20.0s/5m0s  1.00 iters/s

running (0m21.0s), 01/02 VUs, 21 complete and 0 interrupted iterations
baseline   [   7% ] 01/02 VUs  0m21.0s/5m0s  1.00 iters/s

running (0m22.0s), 00/02 VUs, 22 complete and 0 interrupted iterations
baseline   [   7% ] 00/02 VUs  0m22.0s/5m0s  1.00 iters/s

running (0m23.0s), 00/02 VUs, 23 complete and 0 interrupted iterations
baseline   [   8% ] 00/02 VUs  0m23.0s/5m0s  1.00 iters/s

running (0m24.0s), 00/02 VUs, 24 complete and 0 interrupted iterations
baseline   [   8% ] 00/02 VUs  0m24.0s/5m0s  1.00 iters/s

running (0m25.0s), 00/02 VUs, 25 complete and 0 interrupted iterations
baseline   [   8% ] 00/02 VUs  0m25.0s/5m0s  1.00 iters/s

running (0m26.0s), 00/02 VUs, 26 complete and 0 interrupted iterations
baseline   [   9% ] 00/02 VUs  0m26.0s/5m0s  1.00 iters/s

running (0m27.0s), 01/02 VUs, 27 complete and 0 interrupted iterations
baseline   [   9% ] 01/02 VUs  0m27.0s/5m0s  1.00 iters/s

running (0m28.0s), 00/02 VUs, 28 complete and 0 interrupted iterations
baseline   [   9% ] 00/02 VUs  0m28.0s/5m0s  1.00 iters/s

running (0m29.0s), 01/02 VUs, 29 complete and 0 interrupted iterations
baseline   [  10% ] 01/02 VUs  0m29.0s/5m0s  1.00 iters/s

running (0m30.0s), 01/02 VUs, 30 complete and 0 interrupted iterations
baseline   [  10% ] 01/02 VUs  0m30.0s/5m0s  1.00 iters/s

running (0m31.0s), 01/02 VUs, 31 complete and 0 interrupted iterations
baseline   [  10% ] 01/02 VUs  0m31.0s/5m0s  1.00 iters/s

running (0m32.0s), 00/02 VUs, 32 complete and 0 interrupted iterations
baseline   [  11% ] 01/02 VUs  0m32.0s/5m0s  1.00 iters/s

running (0m33.0s), 01/02 VUs, 33 complete and 0 interrupted iterations
baseline   [  11% ] 01/02 VUs  0m33.0s/5m0s  1.00 iters/s

running (0m34.0s), 01/02 VUs, 34 complete and 0 interrupted iterations
baseline   [  11% ] 01/02 VUs  0m34.0s/5m0s  1.00 iters/s

running (0m35.0s), 00/02 VUs, 35 complete and 0 interrupted iterations
baseline   [  12% ] 00/02 VUs  0m35.0s/5m0s  1.00 iters/s

running (0m36.0s), 01/02 VUs, 36 complete and 0 interrupted iterations
baseline   [  12% ] 01/02 VUs  0m36.0s/5m0s  1.00 iters/s

running (0m37.0s), 00/02 VUs, 37 complete and 0 interrupted iterations
baseline   [  12% ] 00/02 VUs  0m37.0s/5m0s  1.00 iters/s

running (0m38.0s), 01/02 VUs, 38 complete and 0 interrupted iterations
baseline   [  13% ] 01/02 VUs  0m38.0s/5m0s  1.00 iters/s

running (0m39.0s), 00/02 VUs, 39 complete and 0 interrupted iterations
baseline   [  13% ] 00/02 VUs  0m39.0s/5m0s  1.00 iters/s

running (0m40.0s), 01/02 VUs, 40 complete and 0 interrupted iterations
baseline   [  13% ] 01/02 VUs  0m40.0s/5m0s  1.00 iters/s

running (0m41.0s), 01/02 VUs, 41 complete and 0 interrupted iterations
baseline   [  14% ] 01/02 VUs  0m41.0s/5m0s  1.00 iters/s

running (0m42.0s), 01/02 VUs, 42 complete and 0 interrupted iterations
baseline   [  14% ] 01/02 VUs  0m42.0s/5m0s  1.00 iters/s

running (0m43.0s), 01/02 VUs, 43 complete and 0 interrupted iterations
baseline   [  14% ] 01/02 VUs  0m43.0s/5m0s  1.00 iters/s

running (0m44.0s), 00/02 VUs, 44 complete and 0 interrupted iterations
baseline   [  15% ] 00/02 VUs  0m44.0s/5m0s  1.00 iters/s

running (0m45.0s), 00/02 VUs, 45 complete and 0 interrupted iterations
baseline   [  15% ] 00/02 VUs  0m45.0s/5m0s  1.00 iters/s

running (0m46.0s), 01/02 VUs, 46 complete and 0 interrupted iterations
baseline   [  15% ] 01/02 VUs  0m46.0s/5m0s  1.00 iters/s

running (0m47.0s), 00/02 VUs, 47 complete and 0 interrupted iterations
baseline   [  16% ] 00/02 VUs  0m47.0s/5m0s  1.00 iters/s

running (0m48.0s), 01/02 VUs, 48 complete and 0 interrupted iterations
baseline   [  16% ] 01/02 VUs  0m48.0s/5m0s  1.00 iters/s

running (0m49.0s), 00/02 VUs, 49 complete and 0 interrupted iterations
baseline   [  16% ] 00/02 VUs  0m49.0s/5m0s  1.00 iters/s

running (0m50.0s), 01/02 VUs, 50 complete and 0 interrupted iterations
baseline   [  17% ] 01/02 VUs  0m50.0s/5m0s  1.00 iters/s

running (0m51.0s), 00/02 VUs, 51 complete and 0 interrupted iterations
baseline   [  17% ] 00/02 VUs  0m51.0s/5m0s  1.00 iters/s

running (0m52.0s), 01/02 VUs, 52 complete and 0 interrupted iterations
baseline   [  17% ] 01/02 VUs  0m52.0s/5m0s  1.00 iters/s

running (0m53.0s), 00/02 VUs, 53 complete and 0 interrupted iterations
baseline   [  18% ] 00/02 VUs  0m53.0s/5m0s  1.00 iters/s

running (0m54.0s), 01/02 VUs, 54 complete and 0 interrupted iterations
baseline   [  18% ] 01/02 VUs  0m54.0s/5m0s  1.00 iters/s

running (0m55.0s), 01/02 VUs, 55 complete and 0 interrupted iterations
baseline   [  18% ] 01/02 VUs  0m55.0s/5m0s  1.00 iters/s

running (0m56.0s), 01/02 VUs, 56 complete and 0 interrupted iterations
baseline   [  19% ] 01/02 VUs  0m56.0s/5m0s  1.00 iters/s

running (0m57.0s), 01/02 VUs, 57 complete and 0 interrupted iterations
baseline   [  19% ] 01/02 VUs  0m57.0s/5m0s  1.00 iters/s

running (0m58.0s), 01/02 VUs, 58 complete and 0 interrupted iterations
baseline   [  19% ] 01/02 VUs  0m58.0s/5m0s  1.00 iters/s

running (0m59.0s), 00/02 VUs, 59 complete and 0 interrupted iterations
baseline   [  20% ] 00/02 VUs  0m59.0s/5m0s  1.00 iters/s

running (1m00.0s), 01/02 VUs, 60 complete and 0 interrupted iterations
baseline   [  20% ] 01/02 VUs  1m00.0s/5m0s  1.00 iters/s

running (1m01.0s), 00/02 VUs, 61 complete and 0 interrupted iterations
baseline   [  20% ] 00/02 VUs  1m01.0s/5m0s  1.00 iters/s

running (1m02.0s), 00/02 VUs, 62 complete and 0 interrupted iterations
baseline   [  21% ] 00/02 VUs  1m02.0s/5m0s  1.00 iters/s

running (1m03.0s), 01/02 VUs, 63 complete and 0 interrupted iterations
baseline   [  21% ] 01/02 VUs  1m03.0s/5m0s  1.00 iters/s

running (1m04.0s), 01/02 VUs, 64 complete and 0 interrupted iterations
baseline   [  21% ] 01/02 VUs  1m04.0s/5m0s  1.00 iters/s

running (1m05.0s), 01/02 VUs, 65 complete and 0 interrupted iterations
baseline   [  22% ] 01/02 VUs  1m05.0s/5m0s  1.00 iters/s

running (1m06.0s), 01/02 VUs, 66 complete and 0 interrupted iterations
baseline   [  22% ] 01/02 VUs  1m06.0s/5m0s  1.00 iters/s

running (1m07.0s), 01/02 VUs, 67 complete and 0 interrupted iterations
baseline   [  22% ] 01/02 VUs  1m07.0s/5m0s  1.00 iters/s

running (1m08.0s), 01/02 VUs, 68 complete and 0 interrupted iterations
baseline   [  23% ] 01/02 VUs  1m08.0s/5m0s  1.00 iters/s

running (1m09.0s), 01/02 VUs, 69 complete and 0 interrupted iterations
baseline   [  23% ] 01/02 VUs  1m09.0s/5m0s  1.00 iters/s

running (1m10.0s), 01/02 VUs, 70 complete and 0 interrupted iterations
baseline   [  23% ] 01/02 VUs  1m10.0s/5m0s  1.00 iters/s

running (1m11.0s), 01/02 VUs, 71 complete and 0 interrupted iterations
baseline   [  24% ] 01/02 VUs  1m11.0s/5m0s  1.00 iters/s

running (1m12.0s), 01/02 VUs, 72 complete and 0 interrupted iterations
baseline   [  24% ] 01/02 VUs  1m12.0s/5m0s  1.00 iters/s

running (1m13.0s), 00/02 VUs, 73 complete and 0 interrupted iterations
baseline   [  24% ] 00/02 VUs  1m13.0s/5m0s  1.00 iters/s

running (1m14.0s), 01/02 VUs, 74 complete and 0 interrupted iterations
baseline   [  25% ] 01/02 VUs  1m14.0s/5m0s  1.00 iters/s

running (1m15.0s), 01/02 VUs, 75 complete and 0 interrupted iterations
baseline   [  25% ] 01/02 VUs  1m15.0s/5m0s  1.00 iters/s

running (1m16.0s), 01/02 VUs, 76 complete and 0 interrupted iterations
baseline   [  25% ] 01/02 VUs  1m16.0s/5m0s  1.00 iters/s

running (1m17.0s), 00/02 VUs, 77 complete and 0 interrupted iterations
baseline   [  26% ] 01/02 VUs  1m17.0s/5m0s  1.00 iters/s

running (1m18.0s), 01/02 VUs, 78 complete and 0 interrupted iterations
baseline   [  26% ] 01/02 VUs  1m18.0s/5m0s  1.00 iters/s

running (1m19.0s), 00/02 VUs, 79 complete and 0 interrupted iterations
baseline   [  26% ] 00/02 VUs  1m19.0s/5m0s  1.00 iters/s

running (1m20.0s), 00/02 VUs, 80 complete and 0 interrupted iterations
baseline   [  27% ] 00/02 VUs  1m20.0s/5m0s  1.00 iters/s

running (1m21.0s), 01/02 VUs, 81 complete and 0 interrupted iterations
baseline   [  27% ] 01/02 VUs  1m21.0s/5m0s  1.00 iters/s

running (1m22.0s), 00/02 VUs, 82 complete and 0 interrupted iterations
baseline   [  27% ] 00/02 VUs  1m22.0s/5m0s  1.00 iters/s

running (1m23.0s), 01/02 VUs, 83 complete and 0 interrupted iterations
baseline   [  28% ] 01/02 VUs  1m23.0s/5m0s  1.00 iters/s

running (1m24.0s), 00/02 VUs, 84 complete and 0 interrupted iterations
baseline   [  28% ] 00/02 VUs  1m24.0s/5m0s  1.00 iters/s

running (1m25.0s), 00/02 VUs, 85 complete and 0 interrupted iterations
baseline   [  28% ] 01/02 VUs  1m25.0s/5m0s  1.00 iters/s

running (1m26.0s), 01/02 VUs, 86 complete and 0 interrupted iterations
baseline   [  29% ] 01/02 VUs  1m26.0s/5m0s  1.00 iters/s

running (1m27.0s), 00/02 VUs, 87 complete and 0 interrupted iterations
baseline   [  29% ] 01/02 VUs  1m27.0s/5m0s  1.00 iters/s

running (1m28.0s), 01/02 VUs, 88 complete and 0 interrupted iterations
baseline   [  29% ] 01/02 VUs  1m28.0s/5m0s  1.00 iters/s

running (1m29.0s), 01/02 VUs, 89 complete and 0 interrupted iterations
baseline   [  30% ] 01/02 VUs  1m29.0s/5m0s  1.00 iters/s

running (1m30.0s), 01/02 VUs, 90 complete and 0 interrupted iterations
baseline   [  30% ] 01/02 VUs  1m30.0s/5m0s  1.00 iters/s

running (1m31.0s), 01/02 VUs, 91 complete and 0 interrupted iterations
baseline   [  30% ] 01/02 VUs  1m31.0s/5m0s  1.00 iters/s

running (1m32.0s), 01/02 VUs, 92 complete and 0 interrupted iterations
baseline   [  31% ] 01/02 VUs  1m32.0s/5m0s  1.00 iters/s

running (1m33.0s), 00/02 VUs, 93 complete and 0 interrupted iterations
baseline   [  31% ] 00/02 VUs  1m33.0s/5m0s  1.00 iters/s

running (1m34.0s), 01/02 VUs, 94 complete and 0 interrupted iterations
baseline   [  31% ] 01/02 VUs  1m34.0s/5m0s  1.00 iters/s

running (1m35.0s), 01/02 VUs, 95 complete and 0 interrupted iterations
baseline   [  32% ] 01/02 VUs  1m35.0s/5m0s  1.00 iters/s

running (1m36.0s), 01/02 VUs, 96 complete and 0 interrupted iterations
baseline   [  32% ] 01/02 VUs  1m36.0s/5m0s  1.00 iters/s

running (1m37.0s), 01/02 VUs, 97 complete and 0 interrupted iterations
baseline   [  32% ] 01/02 VUs  1m37.0s/5m0s  1.00 iters/s

running (1m38.0s), 00/02 VUs, 98 complete and 0 interrupted iterations
baseline   [  33% ] 00/02 VUs  1m38.0s/5m0s  1.00 iters/s

running (1m39.0s), 01/02 VUs, 99 complete and 0 interrupted iterations
baseline   [  33% ] 01/02 VUs  1m39.0s/5m0s  1.00 iters/s

running (1m40.0s), 00/02 VUs, 100 complete and 0 interrupted iterations
baseline   [  33% ] 01/02 VUs  1m40.0s/5m0s  1.00 iters/s

running (1m41.0s), 01/02 VUs, 101 complete and 0 interrupted iterations
baseline   [  34% ] 01/02 VUs  1m41.0s/5m0s  1.00 iters/s

running (1m42.0s), 01/02 VUs, 102 complete and 0 interrupted iterations
baseline   [  34% ] 01/02 VUs  1m42.0s/5m0s  1.00 iters/s

running (1m43.0s), 00/02 VUs, 103 complete and 0 interrupted iterations
baseline   [  34% ] 00/02 VUs  1m43.0s/5m0s  1.00 iters/s

running (1m44.0s), 00/02 VUs, 104 complete and 0 interrupted iterations
baseline   [  35% ] 00/02 VUs  1m44.0s/5m0s  1.00 iters/s

running (1m45.0s), 01/02 VUs, 105 complete and 0 interrupted iterations
baseline   [  35% ] 01/02 VUs  1m45.0s/5m0s  1.00 iters/s

running (1m46.0s), 00/02 VUs, 106 complete and 0 interrupted iterations
baseline   [  35% ] 00/02 VUs  1m46.0s/5m0s  1.00 iters/s

running (1m47.0s), 01/02 VUs, 107 complete and 0 interrupted iterations
baseline   [  36% ] 01/02 VUs  1m47.0s/5m0s  1.00 iters/s

running (1m48.0s), 01/02 VUs, 108 complete and 0 interrupted iterations
baseline   [  36% ] 01/02 VUs  1m48.0s/5m0s  1.00 iters/s

running (1m49.0s), 00/02 VUs, 109 complete and 0 interrupted iterations
baseline   [  36% ] 00/02 VUs  1m49.0s/5m0s  1.00 iters/s

running (1m50.0s), 01/02 VUs, 110 complete and 0 interrupted iterations
baseline   [  37% ] 01/02 VUs  1m50.0s/5m0s  1.00 iters/s

running (1m51.0s), 00/02 VUs, 111 complete and 0 interrupted iterations
baseline   [  37% ] 00/02 VUs  1m51.0s/5m0s  1.00 iters/s

running (1m52.0s), 01/02 VUs, 112 complete and 0 interrupted iterations
baseline   [  37% ] 01/02 VUs  1m52.0s/5m0s  1.00 iters/s

running (1m53.0s), 00/02 VUs, 113 complete and 0 interrupted iterations
baseline   [  38% ] 00/02 VUs  1m53.0s/5m0s  1.00 iters/s

running (1m54.0s), 00/02 VUs, 114 complete and 0 interrupted iterations
baseline   [  38% ] 00/02 VUs  1m54.0s/5m0s  1.00 iters/s

running (1m55.0s), 00/02 VUs, 115 complete and 0 interrupted iterations
baseline   [  38% ] 00/02 VUs  1m55.0s/5m0s  1.00 iters/s

running (1m56.0s), 00/02 VUs, 116 complete and 0 interrupted iterations
baseline   [  39% ] 00/02 VUs  1m56.0s/5m0s  1.00 iters/s

running (1m57.0s), 00/02 VUs, 117 complete and 0 interrupted iterations
baseline   [  39% ] 00/02 VUs  1m57.0s/5m0s  1.00 iters/s

running (1m58.0s), 01/02 VUs, 118 complete and 0 interrupted iterations
baseline   [  39% ] 01/02 VUs  1m58.0s/5m0s  1.00 iters/s

running (1m59.0s), 01/02 VUs, 119 complete and 0 interrupted iterations
baseline   [  40% ] 01/02 VUs  1m59.0s/5m0s  1.00 iters/s

running (2m00.0s), 00/02 VUs, 120 complete and 0 interrupted iterations
baseline   [  40% ] 00/02 VUs  2m00.0s/5m0s  1.00 iters/s

running (2m01.0s), 01/02 VUs, 121 complete and 0 interrupted iterations
baseline   [  40% ] 01/02 VUs  2m01.0s/5m0s  1.00 iters/s

running (2m02.0s), 00/02 VUs, 122 complete and 0 interrupted iterations
baseline   [  41% ] 01/02 VUs  2m02.0s/5m0s  1.00 iters/s

running (2m03.0s), 01/02 VUs, 123 complete and 0 interrupted iterations
baseline   [  41% ] 01/02 VUs  2m03.0s/5m0s  1.00 iters/s

running (2m04.0s), 00/02 VUs, 124 complete and 0 interrupted iterations
baseline   [  41% ] 00/02 VUs  2m04.0s/5m0s  1.00 iters/s

running (2m05.0s), 00/02 VUs, 125 complete and 0 interrupted iterations
baseline   [  42% ] 00/02 VUs  2m05.0s/5m0s  1.00 iters/s

running (2m06.0s), 00/02 VUs, 126 complete and 0 interrupted iterations
baseline   [  42% ] 01/02 VUs  2m06.0s/5m0s  1.00 iters/s

running (2m07.0s), 01/02 VUs, 127 complete and 0 interrupted iterations
baseline   [  42% ] 01/02 VUs  2m07.0s/5m0s  1.00 iters/s

running (2m08.0s), 00/02 VUs, 128 complete and 0 interrupted iterations
baseline   [  43% ] 00/02 VUs  2m08.0s/5m0s  1.00 iters/s

running (2m09.0s), 00/02 VUs, 129 complete and 0 interrupted iterations
baseline   [  43% ] 00/02 VUs  2m09.0s/5m0s  1.00 iters/s

running (2m10.0s), 00/02 VUs, 130 complete and 0 interrupted iterations
baseline   [  43% ] 00/02 VUs  2m10.0s/5m0s  1.00 iters/s

running (2m11.0s), 00/02 VUs, 131 complete and 0 interrupted iterations
baseline   [  44% ] 00/02 VUs  2m11.0s/5m0s  1.00 iters/s

running (2m12.0s), 01/02 VUs, 132 complete and 0 interrupted iterations
baseline   [  44% ] 01/02 VUs  2m12.0s/5m0s  1.00 iters/s

running (2m13.0s), 01/02 VUs, 133 complete and 0 interrupted iterations
baseline   [  44% ] 01/02 VUs  2m13.0s/5m0s  1.00 iters/s

running (2m14.0s), 01/02 VUs, 134 complete and 0 interrupted iterations
baseline   [  45% ] 01/02 VUs  2m14.0s/5m0s  1.00 iters/s

running (2m15.0s), 01/02 VUs, 135 complete and 0 interrupted iterations
baseline   [  45% ] 01/02 VUs  2m15.0s/5m0s  1.00 iters/s

running (2m16.0s), 00/02 VUs, 136 complete and 0 interrupted iterations
baseline   [  45% ] 00/02 VUs  2m16.0s/5m0s  1.00 iters/s

running (2m17.0s), 00/02 VUs, 137 complete and 0 interrupted iterations
baseline   [  46% ] 00/02 VUs  2m17.0s/5m0s  1.00 iters/s

running (2m18.0s), 00/02 VUs, 138 complete and 0 interrupted iterations
baseline   [  46% ] 00/02 VUs  2m18.0s/5m0s  1.00 iters/s

running (2m19.0s), 00/02 VUs, 139 complete and 0 interrupted iterations
baseline   [  46% ] 00/02 VUs  2m19.0s/5m0s  1.00 iters/s

running (2m20.0s), 01/02 VUs, 140 complete and 0 interrupted iterations
baseline   [  47% ] 01/02 VUs  2m20.0s/5m0s  1.00 iters/s

running (2m21.0s), 00/02 VUs, 141 complete and 0 interrupted iterations
baseline   [  47% ] 00/02 VUs  2m21.0s/5m0s  1.00 iters/s

running (2m22.0s), 01/02 VUs, 142 complete and 0 interrupted iterations
baseline   [  47% ] 01/02 VUs  2m22.0s/5m0s  1.00 iters/s

running (2m23.0s), 00/02 VUs, 143 complete and 0 interrupted iterations
baseline   [  48% ] 00/02 VUs  2m23.0s/5m0s  1.00 iters/s

running (2m24.0s), 00/02 VUs, 144 complete and 0 interrupted iterations
baseline   [  48% ] 00/02 VUs  2m24.0s/5m0s  1.00 iters/s

running (2m25.0s), 01/02 VUs, 145 complete and 0 interrupted iterations
baseline   [  48% ] 01/02 VUs  2m25.0s/5m0s  1.00 iters/s

running (2m26.0s), 01/02 VUs, 146 complete and 0 interrupted iterations
baseline   [  49% ] 01/02 VUs  2m26.0s/5m0s  1.00 iters/s

running (2m27.0s), 00/02 VUs, 147 complete and 0 interrupted iterations
baseline   [  49% ] 00/02 VUs  2m27.0s/5m0s  1.00 iters/s

running (2m28.0s), 01/02 VUs, 148 complete and 0 interrupted iterations
baseline   [  49% ] 01/02 VUs  2m28.0s/5m0s  1.00 iters/s

running (2m29.0s), 01/02 VUs, 149 complete and 0 interrupted iterations
baseline   [  50% ] 01/02 VUs  2m29.0s/5m0s  1.00 iters/s

running (2m30.0s), 01/02 VUs, 150 complete and 0 interrupted iterations
baseline   [  50% ] 01/02 VUs  2m30.0s/5m0s  1.00 iters/s

running (2m31.0s), 00/02 VUs, 151 complete and 0 interrupted iterations
baseline   [  50% ] 00/02 VUs  2m31.0s/5m0s  1.00 iters/s

running (2m32.0s), 01/02 VUs, 152 complete and 0 interrupted iterations
baseline   [  51% ] 01/02 VUs  2m32.0s/5m0s  1.00 iters/s

running (2m33.0s), 00/02 VUs, 153 complete and 0 interrupted iterations
baseline   [  51% ] 00/02 VUs  2m33.0s/5m0s  1.00 iters/s

running (2m34.0s), 00/02 VUs, 154 complete and 0 interrupted iterations
baseline   [  51% ] 00/02 VUs  2m34.0s/5m0s  1.00 iters/s

running (2m35.0s), 01/02 VUs, 155 complete and 0 interrupted iterations
baseline   [  52% ] 01/02 VUs  2m35.0s/5m0s  1.00 iters/s

running (2m36.0s), 00/02 VUs, 156 complete and 0 interrupted iterations
baseline   [  52% ] 00/02 VUs  2m36.0s/5m0s  1.00 iters/s

running (2m37.1s), 01/02 VUs, 157 complete and 0 interrupted iterations
baseline   [  52% ] 01/02 VUs  2m37.0s/5m0s  1.00 iters/s

running (2m38.1s), 01/02 VUs, 158 complete and 0 interrupted iterations
baseline   [  53% ] 01/02 VUs  2m38.0s/5m0s  1.00 iters/s

running (2m39.1s), 01/02 VUs, 159 complete and 0 interrupted iterations
baseline   [  53% ] 01/02 VUs  2m39.0s/5m0s  1.00 iters/s

running (2m40.1s), 01/02 VUs, 160 complete and 0 interrupted iterations
baseline   [  53% ] 01/02 VUs  2m40.0s/5m0s  1.00 iters/s

running (2m41.1s), 01/02 VUs, 161 complete and 0 interrupted iterations
baseline   [  54% ] 01/02 VUs  2m41.0s/5m0s  1.00 iters/s

running (2m42.1s), 01/02 VUs, 162 complete and 0 interrupted iterations
baseline   [  54% ] 01/02 VUs  2m42.0s/5m0s  1.00 iters/s

running (2m43.1s), 01/02 VUs, 163 complete and 0 interrupted iterations
baseline   [  54% ] 01/02 VUs  2m43.0s/5m0s  1.00 iters/s

running (2m44.1s), 00/02 VUs, 164 complete and 0 interrupted iterations
baseline   [  55% ] 00/02 VUs  2m44.0s/5m0s  1.00 iters/s

running (2m45.1s), 01/02 VUs, 165 complete and 0 interrupted iterations
baseline   [  55% ] 01/02 VUs  2m45.0s/5m0s  1.00 iters/s

running (2m46.1s), 01/02 VUs, 166 complete and 0 interrupted iterations
baseline   [  55% ] 01/02 VUs  2m46.0s/5m0s  1.00 iters/s

running (2m47.1s), 01/02 VUs, 167 complete and 0 interrupted iterations
baseline   [  56% ] 01/02 VUs  2m47.0s/5m0s  1.00 iters/s

running (2m48.1s), 01/02 VUs, 168 complete and 0 interrupted iterations
baseline   [  56% ] 01/02 VUs  2m48.0s/5m0s  1.00 iters/s

running (2m49.1s), 00/02 VUs, 169 complete and 0 interrupted iterations
baseline   [  56% ] 00/02 VUs  2m49.0s/5m0s  1.00 iters/s

running (2m50.1s), 01/02 VUs, 170 complete and 0 interrupted iterations
baseline   [  57% ] 01/02 VUs  2m50.0s/5m0s  1.00 iters/s

running (2m51.1s), 00/02 VUs, 171 complete and 0 interrupted iterations
baseline   [  57% ] 00/02 VUs  2m51.0s/5m0s  1.00 iters/s

running (2m52.1s), 01/02 VUs, 172 complete and 0 interrupted iterations
baseline   [  57% ] 01/02 VUs  2m52.0s/5m0s  1.00 iters/s

running (2m53.1s), 01/02 VUs, 173 complete and 0 interrupted iterations
baseline   [  58% ] 01/02 VUs  2m53.0s/5m0s  1.00 iters/s

running (2m54.1s), 01/02 VUs, 174 complete and 0 interrupted iterations
baseline   [  58% ] 01/02 VUs  2m54.0s/5m0s  1.00 iters/s

running (2m55.1s), 01/02 VUs, 175 complete and 0 interrupted iterations
baseline   [  58% ] 01/02 VUs  2m55.0s/5m0s  1.00 iters/s

running (2m56.1s), 00/02 VUs, 176 complete and 0 interrupted iterations
baseline   [  59% ] 00/02 VUs  2m56.0s/5m0s  1.00 iters/s

running (2m57.1s), 01/02 VUs, 177 complete and 0 interrupted iterations
baseline   [  59% ] 01/02 VUs  2m57.0s/5m0s  1.00 iters/s

running (2m58.1s), 00/02 VUs, 178 complete and 0 interrupted iterations
baseline   [  59% ] 00/02 VUs  2m58.0s/5m0s  1.00 iters/s

running (2m59.1s), 01/02 VUs, 179 complete and 0 interrupted iterations
baseline   [  60% ] 01/02 VUs  2m59.0s/5m0s  1.00 iters/s

running (3m00.1s), 00/02 VUs, 180 complete and 0 interrupted iterations
baseline   [  60% ] 00/02 VUs  3m00.0s/5m0s  1.00 iters/s

running (3m01.1s), 00/02 VUs, 181 complete and 0 interrupted iterations
baseline   [  60% ] 00/02 VUs  3m01.0s/5m0s  1.00 iters/s

running (3m02.1s), 01/02 VUs, 182 complete and 0 interrupted iterations
baseline   [  61% ] 01/02 VUs  3m02.0s/5m0s  1.00 iters/s

running (3m03.1s), 01/02 VUs, 183 complete and 0 interrupted iterations
baseline   [  61% ] 01/02 VUs  3m03.0s/5m0s  1.00 iters/s

running (3m04.1s), 01/02 VUs, 184 complete and 0 interrupted iterations
baseline   [  61% ] 01/02 VUs  3m04.0s/5m0s  1.00 iters/s

running (3m05.1s), 00/02 VUs, 185 complete and 0 interrupted iterations
baseline   [  62% ] 00/02 VUs  3m05.0s/5m0s  1.00 iters/s

running (3m06.1s), 01/02 VUs, 186 complete and 0 interrupted iterations
baseline   [  62% ] 01/02 VUs  3m06.0s/5m0s  1.00 iters/s

running (3m07.1s), 01/02 VUs, 187 complete and 0 interrupted iterations
baseline   [  62% ] 01/02 VUs  3m07.0s/5m0s  1.00 iters/s

running (3m08.1s), 01/02 VUs, 188 complete and 0 interrupted iterations
baseline   [  63% ] 01/02 VUs  3m08.0s/5m0s  1.00 iters/s

running (3m09.1s), 00/02 VUs, 189 complete and 0 interrupted iterations
baseline   [  63% ] 00/02 VUs  3m09.0s/5m0s  1.00 iters/s

running (3m10.1s), 01/02 VUs, 190 complete and 0 interrupted iterations
baseline   [  63% ] 01/02 VUs  3m10.0s/5m0s  1.00 iters/s

running (3m11.1s), 00/02 VUs, 191 complete and 0 interrupted iterations
baseline   [  64% ] 00/02 VUs  3m11.0s/5m0s  1.00 iters/s

running (3m12.1s), 00/02 VUs, 192 complete and 0 interrupted iterations
baseline   [  64% ] 00/02 VUs  3m12.0s/5m0s  1.00 iters/s

running (3m13.1s), 00/02 VUs, 193 complete and 0 interrupted iterations
baseline   [  64% ] 00/02 VUs  3m13.0s/5m0s  1.00 iters/s

running (3m14.1s), 01/02 VUs, 194 complete and 0 interrupted iterations
baseline   [  65% ] 01/02 VUs  3m14.0s/5m0s  1.00 iters/s

running (3m15.1s), 01/02 VUs, 195 complete and 0 interrupted iterations
baseline   [  65% ] 01/02 VUs  3m15.0s/5m0s  1.00 iters/s

running (3m16.1s), 01/02 VUs, 196 complete and 0 interrupted iterations
baseline   [  65% ] 01/02 VUs  3m16.0s/5m0s  1.00 iters/s

running (3m17.1s), 00/02 VUs, 197 complete and 0 interrupted iterations
baseline   [  66% ] 00/02 VUs  3m17.0s/5m0s  1.00 iters/s

running (3m18.1s), 01/02 VUs, 198 complete and 0 interrupted iterations
baseline   [  66% ] 01/02 VUs  3m18.0s/5m0s  1.00 iters/s

running (3m19.1s), 00/02 VUs, 199 complete and 0 interrupted iterations
baseline   [  66% ] 00/02 VUs  3m19.0s/5m0s  1.00 iters/s

running (3m20.1s), 01/02 VUs, 200 complete and 0 interrupted iterations
baseline   [  67% ] 01/02 VUs  3m20.0s/5m0s  1.00 iters/s

running (3m21.1s), 01/02 VUs, 201 complete and 0 interrupted iterations
baseline   [  67% ] 01/02 VUs  3m21.0s/5m0s  1.00 iters/s

running (3m22.1s), 01/02 VUs, 202 complete and 0 interrupted iterations
baseline   [  67% ] 01/02 VUs  3m22.0s/5m0s  1.00 iters/s

running (3m23.1s), 01/02 VUs, 203 complete and 0 interrupted iterations
baseline   [  68% ] 01/02 VUs  3m23.0s/5m0s  1.00 iters/s

running (3m24.1s), 01/02 VUs, 204 complete and 0 interrupted iterations
baseline   [  68% ] 01/02 VUs  3m24.0s/5m0s  1.00 iters/s

running (3m25.1s), 01/02 VUs, 205 complete and 0 interrupted iterations
baseline   [  68% ] 01/02 VUs  3m25.0s/5m0s  1.00 iters/s

running (3m26.1s), 01/02 VUs, 206 complete and 0 interrupted iterations
baseline   [  69% ] 01/02 VUs  3m26.0s/5m0s  1.00 iters/s

running (3m27.1s), 00/02 VUs, 207 complete and 0 interrupted iterations
baseline   [  69% ] 00/02 VUs  3m27.0s/5m0s  1.00 iters/s

running (3m28.1s), 00/02 VUs, 208 complete and 0 interrupted iterations
baseline   [  69% ] 00/02 VUs  3m28.0s/5m0s  1.00 iters/s

running (3m29.1s), 01/02 VUs, 209 complete and 0 interrupted iterations
baseline   [  70% ] 01/02 VUs  3m29.0s/5m0s  1.00 iters/s

running (3m30.1s), 00/02 VUs, 210 complete and 0 interrupted iterations
baseline   [  70% ] 00/02 VUs  3m30.0s/5m0s  1.00 iters/s

running (3m31.1s), 01/02 VUs, 211 complete and 0 interrupted iterations
baseline   [  70% ] 01/02 VUs  3m31.0s/5m0s  1.00 iters/s

running (3m32.1s), 01/02 VUs, 212 complete and 0 interrupted iterations
baseline   [  71% ] 01/02 VUs  3m32.0s/5m0s  1.00 iters/s

running (3m33.1s), 01/02 VUs, 213 complete and 0 interrupted iterations
baseline   [  71% ] 01/02 VUs  3m33.0s/5m0s  1.00 iters/s

running (3m34.1s), 01/02 VUs, 214 complete and 0 interrupted iterations
baseline   [  71% ] 01/02 VUs  3m34.0s/5m0s  1.00 iters/s

running (3m35.1s), 01/02 VUs, 215 complete and 0 interrupted iterations
baseline   [  72% ] 01/02 VUs  3m35.0s/5m0s  1.00 iters/s

running (3m36.1s), 01/02 VUs, 216 complete and 0 interrupted iterations
baseline   [  72% ] 01/02 VUs  3m36.0s/5m0s  1.00 iters/s

running (3m37.1s), 01/02 VUs, 217 complete and 0 interrupted iterations
baseline   [  72% ] 01/02 VUs  3m37.0s/5m0s  1.00 iters/s

running (3m38.1s), 00/02 VUs, 218 complete and 0 interrupted iterations
baseline   [  73% ] 00/02 VUs  3m38.0s/5m0s  1.00 iters/s

running (3m39.1s), 01/02 VUs, 219 complete and 0 interrupted iterations
baseline   [  73% ] 01/02 VUs  3m39.0s/5m0s  1.00 iters/s

running (3m40.1s), 01/02 VUs, 220 complete and 0 interrupted iterations
baseline   [  73% ] 01/02 VUs  3m40.0s/5m0s  1.00 iters/s

running (3m41.1s), 00/02 VUs, 221 complete and 0 interrupted iterations
baseline   [  74% ] 00/02 VUs  3m41.0s/5m0s  1.00 iters/s

running (3m42.1s), 00/02 VUs, 222 complete and 0 interrupted iterations
baseline   [  74% ] 00/02 VUs  3m42.0s/5m0s  1.00 iters/s

running (3m43.1s), 00/02 VUs, 223 complete and 0 interrupted iterations
baseline   [  74% ] 00/02 VUs  3m43.0s/5m0s  1.00 iters/s

running (3m44.1s), 00/02 VUs, 224 complete and 0 interrupted iterations
baseline   [  75% ] 00/02 VUs  3m44.0s/5m0s  1.00 iters/s

running (3m45.1s), 00/02 VUs, 225 complete and 0 interrupted iterations
baseline   [  75% ] 01/02 VUs  3m45.0s/5m0s  1.00 iters/s

running (3m46.1s), 00/02 VUs, 226 complete and 0 interrupted iterations
baseline   [  75% ] 00/02 VUs  3m46.0s/5m0s  1.00 iters/s

running (3m47.1s), 01/02 VUs, 227 complete and 0 interrupted iterations
baseline   [  76% ] 01/02 VUs  3m47.0s/5m0s  1.00 iters/s

running (3m48.1s), 01/02 VUs, 228 complete and 0 interrupted iterations
baseline   [  76% ] 01/02 VUs  3m48.0s/5m0s  1.00 iters/s

running (3m49.1s), 00/02 VUs, 229 complete and 0 interrupted iterations
baseline   [  76% ] 00/02 VUs  3m49.0s/5m0s  1.00 iters/s

running (3m50.1s), 00/02 VUs, 230 complete and 0 interrupted iterations
baseline   [  77% ] 00/02 VUs  3m50.0s/5m0s  1.00 iters/s

running (3m51.1s), 01/02 VUs, 231 complete and 0 interrupted iterations
baseline   [  77% ] 01/02 VUs  3m51.0s/5m0s  1.00 iters/s

running (3m52.1s), 01/02 VUs, 232 complete and 0 interrupted iterations
baseline   [  77% ] 01/02 VUs  3m52.0s/5m0s  1.00 iters/s

running (3m53.1s), 00/02 VUs, 233 complete and 0 interrupted iterations
baseline   [  78% ] 00/02 VUs  3m53.0s/5m0s  1.00 iters/s

running (3m54.1s), 00/02 VUs, 234 complete and 0 interrupted iterations
baseline   [  78% ] 00/02 VUs  3m54.0s/5m0s  1.00 iters/s

running (3m55.1s), 00/02 VUs, 235 complete and 0 interrupted iterations
baseline   [  78% ] 01/02 VUs  3m55.0s/5m0s  1.00 iters/s

running (3m56.1s), 00/02 VUs, 236 complete and 0 interrupted iterations
baseline   [  79% ] 00/02 VUs  3m56.0s/5m0s  1.00 iters/s

running (3m57.1s), 00/02 VUs, 237 complete and 0 interrupted iterations
baseline   [  79% ] 00/02 VUs  3m57.0s/5m0s  1.00 iters/s

running (3m58.1s), 00/02 VUs, 238 complete and 0 interrupted iterations
baseline   [  79% ] 00/02 VUs  3m58.0s/5m0s  1.00 iters/s

running (3m59.1s), 00/02 VUs, 239 complete and 0 interrupted iterations
baseline   [  80% ] 00/02 VUs  3m59.0s/5m0s  1.00 iters/s

running (4m00.1s), 01/02 VUs, 240 complete and 0 interrupted iterations
baseline   [  80% ] 01/02 VUs  4m00.0s/5m0s  1.00 iters/s

running (4m01.1s), 00/02 VUs, 241 complete and 0 interrupted iterations
baseline   [  80% ] 00/02 VUs  4m01.0s/5m0s  1.00 iters/s

running (4m02.1s), 01/02 VUs, 242 complete and 0 interrupted iterations
baseline   [  81% ] 01/02 VUs  4m02.0s/5m0s  1.00 iters/s

running (4m03.1s), 01/02 VUs, 243 complete and 0 interrupted iterations
baseline   [  81% ] 01/02 VUs  4m03.0s/5m0s  1.00 iters/s

running (4m04.1s), 01/02 VUs, 244 complete and 0 interrupted iterations
baseline   [  81% ] 01/02 VUs  4m04.0s/5m0s  1.00 iters/s

running (4m05.1s), 01/02 VUs, 245 complete and 0 interrupted iterations
baseline   [  82% ] 01/02 VUs  4m05.0s/5m0s  1.00 iters/s

running (4m06.1s), 01/02 VUs, 246 complete and 0 interrupted iterations
baseline   [  82% ] 01/02 VUs  4m06.0s/5m0s  1.00 iters/s

running (4m07.1s), 00/02 VUs, 247 complete and 0 interrupted iterations
baseline   [  82% ] 00/02 VUs  4m07.0s/5m0s  1.00 iters/s

running (4m08.1s), 00/02 VUs, 248 complete and 0 interrupted iterations
baseline   [  83% ] 00/02 VUs  4m08.0s/5m0s  1.00 iters/s

running (4m09.1s), 00/02 VUs, 249 complete and 0 interrupted iterations
baseline   [  83% ] 01/02 VUs  4m09.0s/5m0s  1.00 iters/s

running (4m10.1s), 01/02 VUs, 250 complete and 0 interrupted iterations
baseline   [  83% ] 01/02 VUs  4m10.0s/5m0s  1.00 iters/s

running (4m11.1s), 00/02 VUs, 251 complete and 0 interrupted iterations
baseline   [  84% ] 01/02 VUs  4m11.0s/5m0s  1.00 iters/s

running (4m12.1s), 01/02 VUs, 252 complete and 0 interrupted iterations
baseline   [  84% ] 01/02 VUs  4m12.0s/5m0s  1.00 iters/s

running (4m13.1s), 01/02 VUs, 253 complete and 0 interrupted iterations
baseline   [  84% ] 01/02 VUs  4m13.0s/5m0s  1.00 iters/s

running (4m14.1s), 01/02 VUs, 254 complete and 0 interrupted iterations
baseline   [  85% ] 01/02 VUs  4m14.0s/5m0s  1.00 iters/s

running (4m15.1s), 01/02 VUs, 255 complete and 0 interrupted iterations
baseline   [  85% ] 01/02 VUs  4m15.0s/5m0s  1.00 iters/s

running (4m16.1s), 01/02 VUs, 256 complete and 0 interrupted iterations
baseline   [  85% ] 01/02 VUs  4m16.0s/5m0s  1.00 iters/s

running (4m17.1s), 01/02 VUs, 257 complete and 0 interrupted iterations
baseline   [  86% ] 01/02 VUs  4m17.0s/5m0s  1.00 iters/s

running (4m18.1s), 01/02 VUs, 258 complete and 0 interrupted iterations
baseline   [  86% ] 01/02 VUs  4m18.0s/5m0s  1.00 iters/s

running (4m19.1s), 00/02 VUs, 259 complete and 0 interrupted iterations
baseline   [  86% ] 00/02 VUs  4m19.0s/5m0s  1.00 iters/s

running (4m20.1s), 01/02 VUs, 260 complete and 0 interrupted iterations
baseline   [  87% ] 01/02 VUs  4m20.0s/5m0s  1.00 iters/s

running (4m21.1s), 01/02 VUs, 261 complete and 0 interrupted iterations
baseline   [  87% ] 01/02 VUs  4m21.0s/5m0s  1.00 iters/s

running (4m22.1s), 01/02 VUs, 262 complete and 0 interrupted iterations
baseline   [  87% ] 01/02 VUs  4m22.0s/5m0s  1.00 iters/s

running (4m23.1s), 01/02 VUs, 263 complete and 0 interrupted iterations
baseline   [  88% ] 01/02 VUs  4m23.0s/5m0s  1.00 iters/s

running (4m24.1s), 00/02 VUs, 264 complete and 0 interrupted iterations
baseline   [  88% ] 01/02 VUs  4m24.0s/5m0s  1.00 iters/s

running (4m25.1s), 01/02 VUs, 265 complete and 0 interrupted iterations
baseline   [  88% ] 01/02 VUs  4m25.0s/5m0s  1.00 iters/s

running (4m26.1s), 00/02 VUs, 266 complete and 0 interrupted iterations
baseline   [  89% ] 00/02 VUs  4m26.0s/5m0s  1.00 iters/s

running (4m27.1s), 00/02 VUs, 267 complete and 0 interrupted iterations
baseline   [  89% ] 00/02 VUs  4m27.0s/5m0s  1.00 iters/s

running (4m28.1s), 01/02 VUs, 268 complete and 0 interrupted iterations
baseline   [  89% ] 01/02 VUs  4m28.0s/5m0s  1.00 iters/s

running (4m29.1s), 01/02 VUs, 269 complete and 0 interrupted iterations
baseline   [  90% ] 01/02 VUs  4m29.0s/5m0s  1.00 iters/s

running (4m30.1s), 01/02 VUs, 270 complete and 0 interrupted iterations
baseline   [  90% ] 01/02 VUs  4m30.0s/5m0s  1.00 iters/s

running (4m31.1s), 00/02 VUs, 271 complete and 0 interrupted iterations
baseline   [  90% ] 00/02 VUs  4m31.0s/5m0s  1.00 iters/s

running (4m32.1s), 01/02 VUs, 272 complete and 0 interrupted iterations
baseline   [  91% ] 01/02 VUs  4m32.0s/5m0s  1.00 iters/s

running (4m33.1s), 00/02 VUs, 273 complete and 0 interrupted iterations
baseline   [  91% ] 00/02 VUs  4m33.0s/5m0s  1.00 iters/s

running (4m34.1s), 01/02 VUs, 274 complete and 0 interrupted iterations
baseline   [  91% ] 01/02 VUs  4m34.0s/5m0s  1.00 iters/s

running (4m35.1s), 01/02 VUs, 275 complete and 0 interrupted iterations
baseline   [  92% ] 01/02 VUs  4m35.0s/5m0s  1.00 iters/s

running (4m36.1s), 01/02 VUs, 276 complete and 0 interrupted iterations
baseline   [  92% ] 01/02 VUs  4m36.0s/5m0s  1.00 iters/s

running (4m37.1s), 01/02 VUs, 277 complete and 0 interrupted iterations
baseline   [  92% ] 01/02 VUs  4m37.0s/5m0s  1.00 iters/s

running (4m38.1s), 00/02 VUs, 278 complete and 0 interrupted iterations
baseline   [  93% ] 00/02 VUs  4m38.0s/5m0s  1.00 iters/s

running (4m39.1s), 01/02 VUs, 279 complete and 0 interrupted iterations
baseline   [  93% ] 01/02 VUs  4m39.0s/5m0s  1.00 iters/s

running (4m40.1s), 01/02 VUs, 280 complete and 0 interrupted iterations
baseline   [  93% ] 01/02 VUs  4m40.0s/5m0s  1.00 iters/s

running (4m41.1s), 00/02 VUs, 281 complete and 0 interrupted iterations
baseline   [  94% ] 00/02 VUs  4m41.0s/5m0s  1.00 iters/s

running (4m42.1s), 01/02 VUs, 282 complete and 0 interrupted iterations
baseline   [  94% ] 01/02 VUs  4m42.0s/5m0s  1.00 iters/s

running (4m43.1s), 00/02 VUs, 283 complete and 0 interrupted iterations
baseline   [  94% ] 00/02 VUs  4m43.0s/5m0s  1.00 iters/s

running (4m44.1s), 01/02 VUs, 284 complete and 0 interrupted iterations
baseline   [  95% ] 01/02 VUs  4m44.0s/5m0s  1.00 iters/s

running (4m45.1s), 01/02 VUs, 285 complete and 0 interrupted iterations
baseline   [  95% ] 01/02 VUs  4m45.0s/5m0s  1.00 iters/s

running (4m46.1s), 00/02 VUs, 286 complete and 0 interrupted iterations
baseline   [  95% ] 00/02 VUs  4m46.0s/5m0s  1.00 iters/s

running (4m47.1s), 01/02 VUs, 287 complete and 0 interrupted iterations
baseline   [  96% ] 01/02 VUs  4m47.0s/5m0s  1.00 iters/s

running (4m48.1s), 01/02 VUs, 288 complete and 0 interrupted iterations
baseline   [  96% ] 01/02 VUs  4m48.0s/5m0s  1.00 iters/s

running (4m49.1s), 01/02 VUs, 289 complete and 0 interrupted iterations
baseline   [  96% ] 01/02 VUs  4m49.0s/5m0s  1.00 iters/s

running (4m50.1s), 01/02 VUs, 290 complete and 0 interrupted iterations
baseline   [  97% ] 01/02 VUs  4m50.0s/5m0s  1.00 iters/s

running (4m51.1s), 00/02 VUs, 291 complete and 0 interrupted iterations
baseline   [  97% ] 00/02 VUs  4m51.0s/5m0s  1.00 iters/s

running (4m52.1s), 01/02 VUs, 292 complete and 0 interrupted iterations
baseline   [  97% ] 01/02 VUs  4m52.0s/5m0s  1.00 iters/s

running (4m53.1s), 00/02 VUs, 293 complete and 0 interrupted iterations
baseline   [  98% ] 00/02 VUs  4m53.0s/5m0s  1.00 iters/s

running (4m54.1s), 00/02 VUs, 294 complete and 0 interrupted iterations
baseline   [  98% ] 00/02 VUs  4m54.0s/5m0s  1.00 iters/s

running (4m55.1s), 00/02 VUs, 295 complete and 0 interrupted iterations
baseline   [  98% ] 00/02 VUs  4m55.0s/5m0s  1.00 iters/s

running (4m56.1s), 01/02 VUs, 296 complete and 0 interrupted iterations
baseline   [  99% ] 01/02 VUs  4m56.0s/5m0s  1.00 iters/s

running (4m57.1s), 01/02 VUs, 297 complete and 0 interrupted iterations
baseline   [  99% ] 01/02 VUs  4m57.0s/5m0s  1.00 iters/s

running (4m58.1s), 00/02 VUs, 298 complete and 0 interrupted iterations
baseline   [  99% ] 00/02 VUs  4m58.0s/5m0s  1.00 iters/s

running (4m59.1s), 00/02 VUs, 299 complete and 0 interrupted iterations
baseline   [ 100% ] 00/02 VUs  4m59.0s/5m0s  1.00 iters/s

running (5m00.1s), 00/02 VUs, 300 complete and 0 interrupted iterations
baseline ↓ [ 100% ] 00/02 VUs  5m0s  1.00 iters/s
     ✓ status 201 or 200
     ✓ no 5xx

     checks.........................: 100.00% ✓ 600     ✗ 0
     data_received..................: 231 kB  768 B/s
     data_sent......................: 201 kB  671 B/s
     http_req_blocked...............: avg=13.22µs  min=3µs      med=10µs     max=521µs    p(90)=15µs     p(95)=17µs
     http_req_connecting............: avg=1.63µs   min=0s       med=0s       max=338µs    p(90)=0s       p(95)=0s
   ✓ http_req_duration..............: avg=142.82ms min=133.67ms med=137.01ms max=467.68ms p(90)=149.94ms p(95)=156.66ms
       { expected_response:true }...: avg=142.82ms min=133.67ms med=137.01ms max=467.68ms p(90)=149.94ms p(95)=156.66ms
   ✓ http_req_failed................: 0.00%   ✓ 0       ✗ 300
     http_req_receiving.............: avg=86.31µs  min=35µs     med=73µs     max=1.48ms   p(90)=131.7µs  p(95)=165.09µs
     http_req_sending...............: avg=39.92µs  min=11µs     med=39µs     max=173µs    p(90)=56µs     p(95)=64.04µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=142.69ms min=133.54ms med=136.87ms max=467.48ms p(90)=149.8ms  p(95)=156.54ms
     http_reqs......................: 300     0.99963/s
     iteration_duration.............: avg=143.33ms min=133.95ms med=137.5ms  max=469.84ms p(90)=150.49ms p(95)=157.3ms
     iterations.....................: 300     0.99963/s
     latency_medium.................: avg=142.36ms min=133.67ms med=137.09ms max=403.36ms p(90)=149.1ms  p(95)=156.07ms
     latency_short..................: avg=143.19ms min=133.75ms med=136.93ms max=467.68ms p(90)=150.39ms p(95)=156.74ms
     vus............................: 0       min=0     max=1
     vus_max........................: 2       min=2     max=2
{"scenario":"hub-enrichment/baseline","duration_ms":300111.067,"http_reqs":300,"http_req_failed_rate":0,"http_req_duration":{"p50":137.0165,"p95":156.6681,"p99":null,"avg":142.82278666666676},"checks":{"passes":600,"fails":0},"by_length":{},"result":"PASS","failures":[]}

running (5m00.1s), 00/02 VUs, 300 complete and 0 interrupted iterations
baseline ✓ [ 100% ] 00/02 VUs  5m0s  1.00 iters/s